#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.gcr.google_project_service.api["containerregistry.googleapis.com"]: Refreshing state... [id=tbd-2023-304034/containerregistry.googleapis.com]
module.vpc.module.vpc.module.vpc.google_compute_network.network: Refreshing state... [id=projects/tbd-2023-304034/global/networks/main-vpc]
module.vpc.module.vpc.module.subnets.google_compute_subnetwork.subnetwork["europe-west1/subnet-01"]: Refreshing state... [id=projects/tbd-2023-304034/regions/europe-west1/subnetworks/subnet-01]
module.vpc.google_compute_firewall.default-internal-allow-all: Refreshing state... [id=projects/tbd-2023-304034/global/firewalls/default-internal-allow-all]
module.vpc.google_compute_firewall.fw-allow-ingress-from-iap: Refreshing state... [id=projects/tbd-2023-304034/global/firewalls/fw-allow-ingress-iap]
module.vpc.module.cloud-router.google_compute_router.router: Refreshing state... [id=projects/tbd-2023-304034/regions/europe-west1/routers/nat-router]
module.vpc.module.cloud-router.google_compute_router_nat.nats["nat-gateway"]: Refreshing state... [id=tbd-2023-304034/europe-west1/nat-router/nat-gateway]
module.vpc.module.vpc.module.routes.google_compute_route.route["egress-internet"]: Refreshing state... [id=projects/tbd-2023-304034/global/routes/egress-internet]
module.dataproc.google_project_service.dataproc: Refreshing state... [id=tbd-2023-304034/dataproc.googleapis.com]
module.dataproc.google_dataproc_cluster.tbd-dataproc-cluster: Refreshing state... [id=projects/tbd-2023-304034/regions/europe-west1/clusters/tbd-cluster]
module.gcr.google_container_registry.registry: Refreshing state... [id=eu.artifacts.tbd-2023-304034.appspot.com]
module.jupyter_docker_image.docker_image.jupyter: Refreshing state... [id=sha256:9688f3fe9e07ce65394da4a3b99ea6e946852f7d98cac626171503a162cda73beu.gcr.io/tbd-2023-304034/jupyter:3.6.3]
module.jupyter_docker_image.docker_registry_image.jupyterlab: Refreshing state... [id=sha256:803f1c6a809a319bbf35a66636574bd0c69614a5800b772170cfe5529f8e8899]
module.vertex_ai_workbench.google_project_service.notebooks: Refreshing state... [id=tbd-2023-304034/notebooks.googleapis.com]
module.vertex_ai_workbench.google_storage_bucket.notebook-conf-bucket: Refreshing state... [id=tbd-2023-304034-conf]
module.vertex_ai_workbench.google_storage_bucket_iam_binding.binding: Refreshing state... [id=b/tbd-2023-304034-conf/roles/storage.objectViewer]
module.vertex_ai_workbench.google_storage_bucket_object.post-startup: Refreshing state... [id=tbd-2023-304034-conf-scripts/notebook_post_startup_script.sh]
module.vertex_ai_workbench.google_notebooks_instance.tbd_notebook: Refreshing state... [id=projects/tbd-2023-304034/locations/europe-west1-b/instances/tbd-2023-304034-notebook]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.jupyter_docker_image.docker_image.jupyter has been deleted
  - resource "docker_image" "jupyter" {
        id       = "sha256:9688f3fe9e07ce65394da4a3b99ea6e946852f7d98cac626171503a162cda73beu.gcr.io/tbd-2023-304034/jupyter:3.6.3"
      - name     = "eu.gcr.io/tbd-2023-304034/jupyter:3.6.3" -> null
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.dataproc.google_dataproc_cluster.tbd-dataproc-cluster must be replaced
-/+ resource "google_dataproc_cluster" "tbd-dataproc-cluster" {
      ~ id                            = "projects/tbd-2023-304034/regions/europe-west1/clusters/tbd-cluster" -> (known after apply)
      ~ labels                        = {
          - "goog-dataproc-autozone"     = "enabled"
          - "goog-dataproc-cluster-name" = "tbd-cluster"
          - "goog-dataproc-cluster-uuid" = "07433ce3-9c41-4d9d-813c-db5c3aa3f5bf"
          - "goog-dataproc-location"     = "europe-west1"
        } -> (known after apply)
        name                          = "tbd-cluster"
        # (3 unchanged attributes hidden)

      ~ cluster_config {
          ~ bucket      = "dataproc-staging-europe-west1-449755821280-fzz4ltb0" -> (known after apply)
          ~ temp_bucket = "dataproc-temp-europe-west1-449755821280-m9erghpl" -> (known after apply)

          - endpoint_config {
              - enable_http_port_access = false -> null
              - http_ports              = {} -> null
            }

          ~ gce_cluster_config {
              ~ metadata               = { # forces replacement
                  + "PIP_PACKAGES" = "pandas<2 mlflow==2.3.1 google-cloud-storage==2.9.0"
                }
              + network                = (known after apply)
              ~ service_account_scopes = [
                  - "https://www.googleapis.com/auth/cloud-platform",
                ] -> (known after apply)
              ~ subnetwork             = "https://www.googleapis.com/compute/v1/projects/tbd-2023-304034/regions/europe-west1/subnetworks/subnet-01" -> "projects/tbd-2023-304034/regions/europe-west1/subnetworks/subnet-01"
              - tags                   = [] -> null
              ~ zone                   = "europe-west1-b" -> (known after apply)
                # (1 unchanged attribute hidden)

              - shielded_instance_config {
                  - enable_integrity_monitoring = true -> null
                  - enable_secure_boot          = true -> null
                  - enable_vtpm                 = true -> null
                }
            }

          + initialization_action { # forces replacement
              + script      = "gs://goog-dataproc-initialization-actions-europe-west1/python/pip-install.sh" # forces replacement
              + timeout_sec = 600 # forces replacement
            }

          ~ master_config {
              ~ image_uri        = "https://www.googleapis.com/compute/v1/projects/cloud-dataproc/global/images/dataproc-2-1-ubu20-20230421-045100-rc01" -> (known after apply)
              ~ instance_names   = [
                  - "tbd-cluster-m",
                ] -> (known after apply)
              ~ min_cpu_platform = "AUTOMATIC" -> (known after apply)
                # (2 unchanged attributes hidden)

              ~ disk_config {
                  ~ num_local_ssds    = 0 -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

          - preemptible_worker_config {
              - instance_names = [] -> null
              - num_instances  = 0 -> null

              - disk_config {}
            }

          ~ software_config {
              - optional_components = [] -> null
              - override_properties = {} -> null
              ~ properties          = {
                  - "capacity-scheduler:yarn.scheduler.capacity.root.default.ordering-policy"  = "fair"
                  - "core:fs.gs.block.size"                                                    = "134217728"
                  - "core:fs.gs.metadata.cache.enable"                                         = "false"
                  - "core:hadoop.ssl.enabled.protocols"                                        = "TLSv1,TLSv1.1,TLSv1.2"
                  - "distcp:mapreduce.map.java.opts"                                           = "-Xmx576m"
                  - "distcp:mapreduce.map.memory.mb"                                           = "768"
                  - "distcp:mapreduce.reduce.java.opts"                                        = "-Xmx576m"
                  - "distcp:mapreduce.reduce.memory.mb"                                        = "768"
                  - "hadoop-env:HADOOP_DATANODE_OPTS"                                          = "-Xmx512m"
                  - "hdfs:dfs.datanode.address"                                                = "0.0.0.0:9866"
                  - "hdfs:dfs.datanode.http.address"                                           = "0.0.0.0:9864"
                  - "hdfs:dfs.datanode.https.address"                                          = "0.0.0.0:9865"
                  - "hdfs:dfs.datanode.ipc.address"                                            = "0.0.0.0:9867"
                  - "hdfs:dfs.namenode.handler.count"                                          = "20"
                  - "hdfs:dfs.namenode.http-address"                                           = "0.0.0.0:9870"
                  - "hdfs:dfs.namenode.https-address"                                          = "0.0.0.0:9871"
                  - "hdfs:dfs.namenode.lifeline.rpc-address"                                   = "tbd-cluster-m:8050"
                  - "hdfs:dfs.namenode.secondary.http-address"                                 = "0.0.0.0:9868"
                  - "hdfs:dfs.namenode.secondary.https-address"                                = "0.0.0.0:9869"
                  - "hdfs:dfs.namenode.service.handler.count"                                  = "10"
                  - "hdfs:dfs.namenode.servicerpc-address"                                     = "tbd-cluster-m:8051"
                  - "mapred-env:HADOOP_JOB_HISTORYSERVER_HEAPSIZE"                             = "1024"
                  - "mapred:mapreduce.job.maps"                                                = "9"
                  - "mapred:mapreduce.job.reduce.slowstart.completedmaps"                      = "0.95"
                  - "mapred:mapreduce.job.reduces"                                             = "1"
                  - "mapred:mapreduce.jobhistory.recovery.store.class"                         = "org.apache.hadoop.mapreduce.v2.hs.HistoryServerLeveldbStateStoreService"
                  - "mapred:mapreduce.map.cpu.vcores"                                          = "1"
                  - "mapred:mapreduce.map.java.opts"                                           = "-Xmx1311m"
                  - "mapred:mapreduce.map.memory.mb"                                           = "1639"
                  - "mapred:mapreduce.reduce.cpu.vcores"                                       = "2"
                  - "mapred:mapreduce.reduce.java.opts"                                        = "-Xmx2622m"
                  - "mapred:mapreduce.reduce.memory.mb"                                        = "3278"
                  - "mapred:mapreduce.task.io.sort.mb"                                         = "256"
                  - "mapred:yarn.app.mapreduce.am.command-opts"                                = "-Xmx1311m"
                  - "mapred:yarn.app.mapreduce.am.resource.cpu-vcores"                         = "1"
                  - "mapred:yarn.app.mapreduce.am.resource.mb"                                 = "1639"
                  - "spark-env:SPARK_DAEMON_MEMORY"                                            = "1024m"
                  - "spark:spark.driver.maxResultSize"                                         = "512m"
                  - "spark:spark.driver.memory"                                                = "1024m"
                  - "spark:spark.executor.cores"                                               = "1"
                  - "spark:spark.executor.instances"                                           = "2"
                  - "spark:spark.executor.memory"                                              = "1255m"
                  - "spark:spark.executorEnv.OPENBLAS_NUM_THREADS"                             = "1"
                  - "spark:spark.extraListeners"                                               = "com.google.cloud.spark.performance.DataprocMetricsListener"
                  - "spark:spark.scheduler.mode"                                               = "FAIR"
                  - "spark:spark.sql.cbo.enabled"                                              = "true"
                  - "spark:spark.ui.port"                                                      = "0"
                  - "spark:spark.yarn.am.memory"                                               = "640m"
                  - "yarn-env:YARN_NODEMANAGER_HEAPSIZE"                                       = "409"
                  - "yarn-env:YARN_RESOURCEMANAGER_HEAPSIZE"                                   = "1024"
                  - "yarn-env:YARN_TIMELINESERVER_HEAPSIZE"                                    = "1024"
                  - "yarn:yarn.nodemanager.address"                                            = "0.0.0.0:8026"
                  - "yarn:yarn.nodemanager.resource.cpu-vcores"                                = "2"
                  - "yarn:yarn.nodemanager.resource.memory-mb"                                 = "3278"
                  - "yarn:yarn.resourcemanager.nodemanager-graceful-decommission-timeout-secs" = "86400"
                  - "yarn:yarn.scheduler.maximum-allocation-mb"                                = "3278"
                  - "yarn:yarn.scheduler.minimum-allocation-mb"                                = "1"
                } -> (known after apply)
                # (1 unchanged attribute hidden)
            }

          ~ worker_config {
              ~ image_uri        = "https://www.googleapis.com/compute/v1/projects/cloud-dataproc/global/images/dataproc-2-1-ubu20-20230421-045100-rc01" -> (known after apply)
              ~ instance_names   = [
                  - "tbd-cluster-w-0",
                  - "tbd-cluster-w-1",
                ] -> (known after apply)
              ~ min_cpu_platform = "AUTOMATIC" -> (known after apply)
                # (2 unchanged attributes hidden)

              ~ disk_config {
                  ~ num_local_ssds    = 0 -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }
        }
    }

  # module.jupyter_docker_image.docker_image.jupyter will be created
  + resource "docker_image" "jupyter" {
      + id          = (known after apply)
      + image_id    = (known after apply)
      + name        = "eu.gcr.io/tbd-2023-304034/jupyter:3.6.3"
      + repo_digest = (known after apply)
      + triggers    = {
          + "dir_sha1" = "9f0e0996f434ec07580f8790a4a686e52720a007"
        }

      + build {
          + build_args   = {
              + "JUPYTERLAB_VERSION" = "3.6.3"
              + "PROJECT_NAME"       = "tbd-2023-304034"
            }
          + cache_from   = []
          + context      = "modules/docker_image/resources"
          + dockerfile   = "Dockerfile"
          + extra_hosts  = []
          + remove       = true
          + security_opt = []
          + tag          = [
              + "eu.gcr.io/tbd-2023-304034/jupyter:latest",
            ]
        }
    }

  # module.jupyter_docker_image.docker_registry_image.jupyterlab must be replaced
-/+ resource "docker_registry_image" "jupyterlab" {
      ~ id                   = "sha256:803f1c6a809a319bbf35a66636574bd0c69614a5800b772170cfe5529f8e8899" -> (known after apply)
        name                 = "eu.gcr.io/tbd-2023-304034/jupyter:3.6.3"
      ~ sha256_digest        = "sha256:803f1c6a809a319bbf35a66636574bd0c69614a5800b772170cfe5529f8e8899" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha1" = "afe900c9a12ecbe4555f3a135d1b45e664497a2c" -> "9f0e0996f434ec07580f8790a4a686e52720a007"
        }
        # (2 unchanged attributes hidden)
    }

  # module.vertex_ai_workbench.data.google_project.project will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "tbd-2023-304034"
      + skip_delete         = (known after apply)
    }

  # module.vertex_ai_workbench.google_project_iam_binding.token_creator_role will be created
  + resource "google_project_iam_binding" "token_creator_role" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = (known after apply)
      + project = "tbd-2023-304034"
      + role    = "roles/iam.serviceAccountTokenCreator"
    }

  # module.vertex_ai_workbench.google_storage_bucket_iam_binding.binding will be updated in-place
  ~ resource "google_storage_bucket_iam_binding" "binding" {
        id      = "b/tbd-2023-304034-conf/roles/storage.objectViewer"
      ~ members = [
          - "serviceAccount:449755821280-compute@developer.gserviceaccount.com",
        ] -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 4 to add, 1 to change, 2 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "iac_service_account" but a
value was found in file "env/project.tfvars". If you meant to use this value,
add a "variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @hubertDec, Action: `pull_request`, Working Directory: ``, Workflow: `Tech Tests`*